fa-xbrl/src/Catalogs/velpo_FieldQueryLinks/velpo_FieldQueryLinks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>velpo_FieldQueryLinks</name>
  <owners>ChartOfCharacteristicTypes.velpo_SourceQueryComponents</owners>
  <attributes>
    <name>LinkType</name>
    <type>
      <types>EnumRef.velpo_FieldQueryLinkTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Axis</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_HypercubeAxes</types>
    </type>
  </attributes>
  <attributes>
    <name>Concept</name>
    <type>
      <types>ChartOfAccountsRef.velpo_Reporting</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSourceValue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Result</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>DataType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_ValueDataTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>UseFieldLink</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FieldLink</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>UseTotals</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Unique</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AxisSetNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.velpo_Units</types>
    </type>
  </attributes>
  <attributes>
    <name>NegativeSign</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UsePeriod</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FieldPeriodStart</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>FieldPeriodEnd</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AxisLinks</name>
    <attributes>
      <name>Otherwise</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>FieldValue</name>
      <type>
        <types>Characteristic.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>Axis</name>
      <type>
        <types>Characteristic.velpo_HypercubeAxes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ConceptLinks</name>
    <attributes>
      <name>Otherwise</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>FieldValue</name>
      <type>
        <types>Characteristic.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.velpo_ValueDataTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FieldFilters</name>
    <attributes>
      <name>FilterType</name>
      <type>
        <types>EnumRef.velpo_FilterQueryTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Field</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>ComparisonType</name>
      <type>
        <types>EnumRef.velpo_ComparisonQueryTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>UniqueFields</name>
    <attributes>
      <name>Field</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fa-xbrl/src/Enums/velpo_FieldQueryLinkTypes/velpo_FieldQueryLinkTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>velpo_FieldQueryLinkTypes</name>
  <enumValues>
    <name>Axis</name>
  </enumValues>
  <enumValues>
    <name>Concept</name>
  </enumValues>
</mdclass:Enum>

fa-xbrl/src/Catalogs/velpo_FieldQueryLinks/Forms/ItemForm/Module.bsl
&AtServer
Procedure SetConceptValueList()

	Items.ConceptLinksValue.ChoiceList.Clear();
	Items.ConceptLinksValue.ListChoiceMode = False;
	
	If ValueIsFilled(Object.DataType) Then
		Query = New Query;
		Query.SetParameter("DataType", Object.DataType);
		Query.Text =
		"SELECT
		|	Member
		|FROM
		|	ChartOfCharacteristicTypes.ConceptValueTypes.Members
		|WHERE
		|	Ref = &DataType
		|";
		MemberValues = Query.Execute().Unload().UnloadColumn("Member");
		If MemberValues.Count() > 0 Then
			Items.ConceptLinksValue.ChoiceList.LoadValues(MemberValues);
			Items.ConceptLinksValue.ListChoiceMode = True;
		EndIf;
		
	EndIf;

EndProcedure // SetConceptValueList()

&AtServer
Procedure SetConceptValueType()

	If ValueIsFilled(Object.Concept) Then
		Object.DataType = velpo_CommonFunctions.ObjectAttributeValue(Object.Concept, "DataType");
	Else
		Object.DataType = Undefined;
	EndIf; 

	SetConceptValueList();
	
EndProcedure // SetConceptValueType()

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Object.Ref.IsEmpty() AND ValueIsFilled(Parameters.Result) Then
		Object.AxisType = Parameters.AxisType;
		Object.Concept = Parameters.Concept;
		Object.Result = Parameters.Result;
		Object.Owner = Parameters.Field;
		If ValueIsFilled(Object.Concept) Then
			Object.LinkType = Enums.velpo_FieldQueryLinkTypes.Concept;
			Object.AxisType =  Undefined;
		Else
			Object.LinkType = Enums.velpo_FieldQueryLinkTypes.AxisType;
			Object.Concept =  Undefined;
		EndIf;
		SetConceptValueType();
	Else
		SetConceptValueList();
	EndIf;
			
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	
	Notify("NewLink", Object.Ref);
	
EndProcedure

&AtClient
Procedure ConceptOnChange(Item)
	
	SetConceptValueType();
	
EndProcedure

&AtClient
Procedure ConceptValueTypeOnChange(Item)
	
	SetConceptValueList();
	
EndProcedure

&AtClient
Procedure ConceptLinksBeforeEditEnd(Item, NewRow, CancelEdit, Cancel)
	
	Object.UseSourceValue = False;
	
EndProcedure

&AtClient
Procedure AxisLinksBeforeEditEnd(Item, NewRow, CancelEdit, Cancel)
	
	Object.UseSourceValue = False;
	
EndProcedure



&НаСервере
Процедура AutofillНаСервере()
	
	Query = New Query;
	Query.SetParameter("AxisType", Object.AxisType);
	Query.Text  =
	"SELECT
	|	Ref AS Axis, 
	|	Description
	|FROM
	|	Catalog.DomainMembers
	|WHERE
	|	Owner = &AxisType
	|";
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		AxisLinksLine = Object.AxisLinks.Add();
		AxisLinksLine.Axis = Selection.Axis;
		FieldValue = "";
		Len = StrLen(Selection.Description);
		For i = 1 To Len Do
			Letter = Mid(Selection.Description, i, 1);
			If СтрНайти("0123456789", Letter) > 0 Then
				FieldValue = FieldValue + Letter;
			Else
				Break;
			EndIf;
		EndDo;
		AxisLinksLine.FieldValue = FieldValue;
	EndDo;
		
КонецПроцедуры

&НаКлиенте
Процедура Autofill(Команда)
	AutofillНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура LoadFromValueList(Команда)

	ОткрытьФорму("Справочник.FieldQueryLinks.Форма.LoadFromValueList",, ThisForm);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	If ИмяСобытия = "LoadFromValueList" Then
		For Each FilterLine In Параметр Do
			Line = Object.FieldFilters.Add();
			FillPropertyValues(Line, FilterLine);
		EndDo;
	EndIf;
	
КонецПроцедуры

&НаСервере
Процедура AutofillConceptsНаСервере()
	
		Query = New Query;
		Query.SetParameter("DataType", Object.DataType);
		Query.Text =
		"SELECT
		|	Member
		|FROM
		|	ChartOfCharacteristicTypes.ConceptValueTypes.Members
		|WHERE
		|	Ref = &DataType
		|";
		MemberValues = Query.Execute().Unload().UnloadColumn("Member");
		If MemberValues.Count() > 0 Then
			
			For each Member In MemberValues Do
				AxisLinksLine = Object.ConceptLinks.Add();
				AxisLinksLine.FieldValue = TrimAll(String(Member));
				AxisLinksLine.Value = Member;
			EndDo;
			
		EndIf;

		
КонецПроцедуры

&НаКлиенте
Процедура AutofillConcepts(Команда)
	AutofillConceptsНаСервере();
КонецПроцедуры
